Angad2205/Yog-Guru-VLSID-design-challenge/camera/bootloader/board/pin_mux.c
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v9.0
processor: MIMXRT117Hxxxxx
package_id: MIMXRT117HDVMAA
mcu_data: ksdk2_0
processor_version: 9.0.2
board: SLN_VIZN3D_IOT
pin_labels:
- {pin_num: P1, pin_signal: GPIO_EMC_B2_08, label: 'SEMC_DM2/U25[15]', identifier: SEMC_DM2;CAMERA_RST;BRIDGE_RESET}
- {pin_num: R1, pin_signal: GPIO_EMC_B2_03, label: 'SEMC_D19/U25[7]', identifier: SEMC_D19;QN_WAKEUP}
- {pin_num: K2, pin_signal: GPIO_EMC_B2_00, label: 'SEMC_D16/U25[2]', identifier: SEMC_D16;RED_LED}
- {pin_num: L2, pin_signal: GPIO_EMC_B2_15, label: 'SEMC_D30/U25[51]', identifier: SEMC_D30;RESET}
- {pin_num: M2, pin_signal: GPIO_EMC_B2_12, label: 'SEMC_D27/U25[47]', identifier: SEMC_D27;DISP_RST;LCD_RST_B}
- {pin_num: R2, pin_signal: GPIO_EMC_B2_10, label: 'SEMC_D25/U25[44]', identifier: SEMC_D25;CTP_INT}
- {pin_num: K3, pin_signal: GPIO_EMC_B2_02, label: 'SEMC_D18/U25[5]', identifier: SEMC_D18;BLUE_LED}
- {pin_num: K4, pin_signal: GPIO_EMC_B2_01, label: 'SEMC_D17/U25[4]', identifier: SEMC_D17;GREEN_LED}
- {pin_num: L4, pin_signal: GPIO_EMC_B2_11, label: 'SEMC_D26/U25[45]', identifier: SEMC_D26;CTP_RST_B}
- {pin_num: M4, pin_signal: GPIO_EMC_B2_14, label: 'SEMC_D29/U25[50]', identifier: SEMC_D29;IR_RESET}
- {pin_num: N12, pin_signal: GPIO_AD_00, label: 'SIM1_TRXD/J44[C7]/J57[9]/CTP_INT/J48[29]/J25[15]/J9[14]', identifier: SIM1_TRXD;MCLK}
- {pin_num: F14, pin_signal: GPIO_SD_B2_04, label: 'FlexSPI_B_CLK/U21[B1]', identifier: FlexSPI_B_CLK;PWDN}
- {pin_num: R14, pin_signal: GPIO_AD_01, label: 'SIM1_CLK/J44[C3]/J57[7]/CTP_RST_B/J48[28]/J10[4]/J25[13]', identifier: SIM1_CLK;PIXCLK}
- {pin_num: J14, pin_signal: GPIO_SD_B2_01, label: 'FlexSPI_B_D2/U21[E2]', identifier: FlexSPI_B_D2;PWDN}
- {pin_num: B5, pin_signal: GPIO_DISP_B2_08, label: 'ENET_CRS_DV/U7[18]', identifier: ENET_CRS_DV;QN_UART_TX}
- {pin_num: D8, pin_signal: GPIO_DISP_B2_09, label: 'ENET_RXER/U7[20]', identifier: ENET_RXER;QN_UART_RX}
- {pin_num: A7, pin_signal: GPIO_DISP_B2_14, label: INT2_COMBO/CSI_RST_B, identifier: CAMERA_RST;VSYNC}
- {pin_num: A4, pin_signal: GPIO_DISP_B2_15, label: 'WDOG_B/LCM_PWR_EN/J48[32]', identifier: DISP_POWER}
- {pin_num: R13, pin_signal: GPIO_AD_02, label: 'SIM1_RST/J57[5]/J44[C2]/LCD_RST_B/J48[21]/J25[11]/J10[6]', identifier: SIM1_RST;DISP_RST;HSYNC}
- {pin_num: P15, pin_signal: GPIO_AD_03, label: 'SIM1_SVEN/J57[2]/Flash_RST/U21[B2]/J25[9]/J10[8]', identifier: SIM1_SVEN;WHITE_LED}
- {pin_num: M13, pin_signal: GPIO_AD_04, label: 'SIM1_PD/J44[C8]/USER_LED_CTL1/J9[8]/J25[7]', identifier: SIM1_PD;IR_LED}
- {pin_num: P13, pin_signal: GPIO_AD_05, label: 'SIM1_PWR_FAIL/J9[12]/J25[5]/LCD_LPTE', identifier: SIM1_PWR_FAIL;LCD_LPTE}
- {pin_num: N13, pin_signal: GPIO_AD_06, label: 'USB_OTG2_OC/U18[A2]/J9[10]/AUD_INT', identifier: DISP_BL;Backlight_CTL}
- {pin_num: T17, pin_signal: GPIO_AD_07, label: 'USB_OTG2_PWR/WL_DEV_WAKE/U354[10]/J10[2]', identifier: AP_LDP_INT;CAMERA_LDP}
- {pin_num: L14, pin_signal: GPIO_AD_26, label: 'CSI_PWR_CTL/USER_LED_CTL2/J50[16]', identifier: CAMERA_PWDN}
- {pin_num: K17, pin_signal: GPIO_AD_30, label: 'LPSPI1_SDO/U27[5]/J10[8]/Backlight_CTL/J48[34]/U46[4]', identifier: LPSPI1_SDO;DISP_BL}
- {pin_num: K16, pin_signal: GPIO_AD_32, label: 'ENET_MDC/U7[12]/SD1_CD_B/J15[9]', identifier: ENET_MDC;VSYNC}
- {pin_num: R10, pin_signal: GPIO_SNVS_00, label: 'J42[3]', identifier: Green_LED;GREEN_LED}
- {pin_num: P10, pin_signal: GPIO_SNVS_01, label: 'J42[4]', identifier: RED_LED}
- {pin_num: L9, pin_signal: GPIO_SNVS_02, label: 'J42[5]', identifier: RESET;CAMERA_RST}
- {pin_num: M10, pin_signal: GPIO_SNVS_03, label: 'J42[6]', identifier: SW2}
- {pin_num: N10, pin_signal: GPIO_SNVS_04, label: 'J42[7]', identifier: SW1}
- {pin_num: P9, pin_signal: GPIO_SNVS_05, label: 'J42[8]', identifier: QN_WAKEUP}
- {pin_num: M9, pin_signal: GPIO_SNVS_06, label: 'J42[9]', identifier: CAMERA_PWR}
- {pin_num: R9, pin_signal: GPIO_SNVS_07, label: 'J42[10]', identifier: SW3}
- {pin_num: N9, pin_signal: GPIO_SNVS_08, label: 'J42[11]', identifier: CAMERA_test}
- {pin_num: R11, pin_signal: GPIO_SNVS_09, label: 'J42[12]', identifier: BLUE_LED;AP_LDP_INT}
- {pin_num: T8, pin_signal: WAKEUP, label: USER_BUTTON, identifier: USER_BUTTON;PB_WAKEUP;BLE_WAKE}
- {pin_num: T9, pin_signal: PMIC_STBY_REQ, label: 'PMIC_STBY_REQ/U353[6]', identifier: PMIC_STBY_REQ;VDD_1V2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {

    BOARD_InitPushButtonPins();
    BOARD_InitLedPins();
    BOARD_InitRGBLedPins();
    BOARD_InitDebugConsolePins();
    BOARD_InitMipiPanelPins();
}

/*
* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitMipiPanelPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
 - {pin_num: A4, peripheral: GPIO11, signal: 'gpio_io, 16', pin_signal: GPIO_DISP_B2_15, software_input_on: Disable}
 - {pin_num: N8, peripheral: LPI2C5, signal: SCL, pin_signal: GPIO_LPSR_05, software_input_on: Enable,
pull_up_down_config: Pull_Down, pull_keeper_select: Keeper, open_drain: Enable, drive_strength: Normal, slew_rate: Slow}
 - {pin_num: N7, peripheral: LPI2C5, signal: SDA, pin_signal: GPIO_LPSR_04, software_input_on: Enable,
pull_up_down_config: Pull_Down, pull_keeper_select: Keeper, open_drain: Enable, drive_strength: Normal, slew_rate: Slow}
 - {pin_num: N12, peripheral: GPIO8, signal: 'gpio_io, 31', pin_signal: GPIO_AD_00, software_input_on: Enable,
pull_up_down_config: Pull_Down, pull_keeper_select: Keeper, open_drain: Disable, drive_strength: Normal, slew_rate:
Slow}
 - {pin_num: R14, peripheral: GPIO9, signal: 'gpio_io, 00', pin_signal: GPIO_AD_01, pull_up_down_config: Pull_Down,
pull_keeper_select: Keeper, open_drain: Disable, drive_strength: Normal, slew_rate: Slow}
 - {pin_num: R13, peripheral: GPIO9, signal: 'gpio_io, 01', pin_signal: GPIO_AD_02}
 - {pin_num: K17, peripheral: GPIO9, signal: 'gpio_io, 29', pin_signal: GPIO_AD_30}
* BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
*/

