Angad2205/Yog-Guru-VLSID-design-challenge/camera/bootloader/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitRGBLedPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: K4, peripheral: GPIO2, signal: 'gpio_mux_io, 11', pin_signal: GPIO_EMC_B2_01, identifier: GREEN_LED}
  - {pin_num: K2, peripheral: GPIO2, signal: 'gpio_mux_io, 10', pin_signal: GPIO_EMC_B2_00, identifier: RED_LED}
  - {pin_num: K3, peripheral: GPIO2, signal: 'gpio_mux_io, 12', pin_signal: GPIO_EMC_B2_02, identifier: BLUE_LED}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitRGBLedPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitRGBLedPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_00_GPIO_MUX2_IO10,   /* GPIO_EMC_B2_00 is configured as GPIO_MUX2_IO10 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_01_GPIO_MUX2_IO11,   /* GPIO_EMC_B2_01 is configured as GPIO_MUX2_IO11 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_02_GPIO_MUX2_IO12,   /* GPIO_EMC_B2_02 is configured as GPIO_MUX2_IO12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_GPR->GPR40 = ((IOMUXC_GPR->GPR40 &
    (~(IOMUXC_GPR_GPR40_GPIO_MUX2_GPIO_SEL_LOW_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR40_GPIO_MUX2_GPIO_SEL_LOW(0x00U) /* GPIO2 and CM7_GPIO2 share same IO MUX function, GPIO_MUX2 selects one GPIO function: 0x00U */
    );

  gpio_pin_config_t rgb_led_config = {
      .direction = kGPIO_DigitalOutput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };

  GPIO_PinInit(GPIO2, 10, &rgb_led_config);
  GPIO_PinInit(GPIO2, 11, &rgb_led_config);
  GPIO_PinInit(GPIO2, 12, &rgb_led_config);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitParallelCameraPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: P8, peripheral: LPI2C6, signal: SDA, pin_signal: GPIO_LPSR_06, identifier: '', software_input_on: Enable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Enable, drive_strength: Normal, slew_rate: Slow}
  - {pin_num: R8, peripheral: LPI2C6, signal: SCL, pin_signal: GPIO_LPSR_07, identifier: '', software_input_on: Enable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Enable, drive_strength: Normal}
  - {pin_num: P17, peripheral: CSI, signal: csi_pixclk, pin_signal: GPIO_AD_12}
  - {pin_num: L12, peripheral: CSI, signal: csi_mclk, pin_signal: GPIO_AD_13, drive_strength: Normal}
  - {pin_num: N14, peripheral: CSI, signal: csi_vsync, pin_signal: GPIO_AD_14}
  - {pin_num: M14, peripheral: CSI, signal: csi_hsync, pin_signal: GPIO_AD_15, identifier: ''}
  - {pin_num: N17, peripheral: CSI, signal: 'csi_data, 09', pin_signal: GPIO_AD_16, identifier: ''}
  - {pin_num: N15, peripheral: CSI, signal: 'csi_data, 08', pin_signal: GPIO_AD_17}
  - {pin_num: M16, peripheral: CSI, signal: 'csi_data, 07', pin_signal: GPIO_AD_18}
  - {pin_num: L16, peripheral: CSI, signal: 'csi_data, 06', pin_signal: GPIO_AD_19}
  - {pin_num: K13, peripheral: CSI, signal: 'csi_data, 05', pin_signal: GPIO_AD_20}
  - {pin_num: K14, peripheral: CSI, signal: 'csi_data, 04', pin_signal: GPIO_AD_21, identifier: ''}
  - {pin_num: K12, peripheral: CSI, signal: 'csi_data, 03', pin_signal: GPIO_AD_22, identifier: ''}
  - {pin_num: J12, peripheral: CSI, signal: 'csi_data, 02', pin_signal: GPIO_AD_23, identifier: ''}
  - {pin_num: M4, peripheral: GPIO2, signal: 'gpio_mux_io, 24', pin_signal: GPIO_EMC_B2_14, pull_down_pull_up_config: Pull_Up, pdrv_config: High_Driver}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitParallelCameraPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitParallelCameraPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);      /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_12_VIDEO_MUX_CSI_PIXCLK,  /* GPIO_AD_12 is configured as VIDEO_MUX_CSI_PIXCLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_13_VIDEO_MUX_CSI_MCLK,   /* GPIO_AD_13 is configured as VIDEO_MUX_CSI_MCLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_14_VIDEO_MUX_CSI_VSYNC,  /* GPIO_AD_14 is configured as VIDEO_MUX_CSI_VSYNC */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_15_VIDEO_MUX_CSI_HSYNC,  /* GPIO_AD_15 is configured as VIDEO_MUX_CSI_HSYNC */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_16_VIDEO_MUX_CSI_DATA09,  /* GPIO_AD_16 is configured as VIDEO_MUX_CSI_DATA09 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_17_VIDEO_MUX_CSI_DATA08,  /* GPIO_AD_17 is configured as VIDEO_MUX_CSI_DATA08 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_18_VIDEO_MUX_CSI_DATA07,  /* GPIO_AD_18 is configured as VIDEO_MUX_CSI_DATA07 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_19_VIDEO_MUX_CSI_DATA06,  /* GPIO_AD_19 is configured as VIDEO_MUX_CSI_DATA06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_20_VIDEO_MUX_CSI_DATA05,  /* GPIO_AD_20 is configured as VIDEO_MUX_CSI_DATA05 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_21_VIDEO_MUX_CSI_DATA04,  /* GPIO_AD_21 is configured as VIDEO_MUX_CSI_DATA04 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_22_VIDEO_MUX_CSI_DATA03,  /* GPIO_AD_22 is configured as VIDEO_MUX_CSI_DATA03 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_23_VIDEO_MUX_CSI_DATA02,  /* GPIO_AD_23 is configured as VIDEO_MUX_CSI_DATA02 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_14_GPIO_MUX2_IO24,   /* GPIO_EMC_B2_14 is configured as GPIO_MUX2_IO24 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_GPR->GPR41 = ((IOMUXC_GPR->GPR41 &
    (~(IOMUXC_GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR41_GPIO_MUX2_GPIO_SEL_HIGH(0x00U) /* GPIO2 and CM7_GPIO2 share same IO MUX function, GPIO_MUX2 selects one GPIO function: 0x00U */
    );
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_06_LPI2C6_SDA,         /* GPIO_LPSR_06 is configured as LPI2C6_SDA */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_LPSR_06 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_07_LPI2C6_SCL,         /* GPIO_LPSR_07 is configured as LPI2C6_SCL */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_LPSR_07 */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_13_VIDEO_MUX_CSI_MCLK,   /* GPIO_AD_13 PAD functional properties : */
      0x04U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B2_14_GPIO_MUX2_IO24,   /* GPIO_EMC_B2_14 PAD functional properties : */
      0x04U);                                 /* PDRV Field: high drive strength
                                                 Pull Down Pull Up Field: Internal pullup resistor enabled
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_LPSR_06_LPI2C6_SDA,         /* GPIO_LPSR_06 PAD functional properties : */
      0x20U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal driver
                                                 Pull / Keep Select Field: Pull Disable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain LPSR Field: Enabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_LPSR_07_LPI2C6_SCL,         /* GPIO_LPSR_07 PAD functional properties : */
      0x20U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal driver
                                                 Pull / Keep Select Field: Pull Disable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain LPSR Field: Enabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}


