Angad2205/Yog-Guru-VLSID-design-challenge/camera/bootloader/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: N6, peripheral: LPUART12, signal: TXD, pin_signal: GPIO_LPSR_00, identifier: ''}
  - {pin_num: R6, peripheral: LPUART12, signal: RXD, pin_signal: GPIO_LPSR_01, identifier: '', software_input_on: Enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);      /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_00_LPUART12_TXD,       /* GPIO_LPSR_00 is configured as LPUART12_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_01_LPUART12_RXD,       /* GPIO_LPSR_01 is configured as LPUART12_RXD */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_LPSR_01 */

}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
